crosscon/crosscon_puf_authentication/LPC55S69_PAWOS/source/LPC55S69_PAWOS.c
    JSONStatus_t result;
    result = JSON_Validate(path_json, path_length);

    if( result == JSONSuccess )
    {
        // result = JSON_Search( buffer2, bufferLength, query, queryLength,
        //                              &value, &valueLength );
   	 result = JSON_Search(path_json, path_length, rule, ruleLength, &rule_value, &rule_valueLength);
   	 result = JSON_Search(path_json, path_length, path, pathLength, &path_value, &path_valueLength);
     }

    if( result == JSONSuccess )
    {
                // The pointer "value" will point to a location in the "buffer".
          //char save = rule_value[ rule_valueLength ];
                // After saving the character, set it to a null byte for printing.
        /* char helper[rule_valueLength];
         memcpy(helper, rule_value, rule_valueLength);
    	 rule_value[ rule_valueLength ] = '\0';
                // "Found: bar.foo -> xyz" will be printed.
          //PRINTF( "Found: %s -> %s\n", rule, rule_value );
                // Restore the original character.
                //value[ valueLength ] = save;

          //char save = path_value[ path_valueLength ];
                // After saving the character, set it to a null byte for printing.
          path_value[ path_valueLength ] = '\0';
                // "Found: bar.foo -> xyz" will be printed.
          //PRINTF( "Found: %s -> %s\n", path, path_value );
           *
           */
      }

    int rule_Length = (rule_valueLength-1) / 2;
    int path_Length = (path_valueLength-1) / 65;
    uint8_t rule_res [rule_Length];
    uint8_t path_res [path_Length][32];


    int idx = 1;
    int i;
    for(i = 0; i < rule_Length; i++) {
   	 rule_res[i] = *(rule_value + idx) - '0';
   	 idx = idx + 2;
    }
    path_value += 2;
    for(i = 0; i < path_Length - 1; i++) {

   	 hex_to_bytes_array(path_value, path_res[i], 64);
   	 path_value += 67;
    }
    hex_to_bytes_array(path_value, path_res[path_Length - 1], 64);
    //PRINTF("rest: %u, ", getCycleCount() - st);
    //uint8_t root2[32];
    //unsigned long st,end;
    //enableCycleCounter();
    //resetCycleCounter();
    	//st = getCycleCount();

    if (memcmp(leaf, path_res[0], 32) != 0) {
    	return 1;
    }
    int res = verify_path(rule_res, path_res, rule_Length, root);
    	//if (result == 0) {
    		//PRINTF("%u, ", getCycleCount() - st);
    	//}
    	//resetCycleCounter();
    return res;
}




int verify_path(uint8_t rules[], uint8_t path[][32], size_t len, uint8_t root[]) {


	uint8_t res[32];
	int index = 0;
	uint8_t bit = rules[0];
	uint8_t input[65];
	uint8_t digest[32];
	memcpy(res, path[0], 32);
	while (index < len - 1)
	{
		uint8_t next_bit = rules[index+1];
		memcpy(digest, path[index + 1], 32);
		//hex_to_bytes_array(path1[index+1], digest, strlen(path1[index+1]));
	        //memcpy(digest, path1[index+1], strlen(digest));
	        //memcpy(input, res, 32);
	        //memcpy(input[32], path[index], 32);

		switch (bit) {
	        case 0:
	            memset(input, 0x01, 1);
	            memcpy(input + 1 , res, 32);
	            memcpy(input + 33, digest, 32);
	            calc_sha_256(res, input, 65 );
	            break;
	        case 1:
	            memset(input, 0x01, 1);
	            memcpy(input + 1, digest, 32);
	            memcpy(input + 33, res, 32);
	            calc_sha_256(res, input, 65 );
	            break;
	        default:
	            break;
	        }
	        bit = next_bit;
	        index++;
	    }
	if(memcmp(root, res, 32) == 0) {
		return 0;
	}
	return 1;
}


/*
void HASH_F(struct params *param, uint8_t *out, uint8_t *in, uint8_t *bitmaskSeed, uint32_t addr[8] ) {

    uint8_t buf[3 * param->n];
    uint8_t bitmask[param->n];
    uint8_t addr_as_bytes[32];

    //set padding of hash function
    ull_to_bytes(buf, param->n, 3);

    //generate n-byte key
    set_key_or_mask(addr, 0);
    addr_to_bytes(addr_as_bytes, addr);
    PRF(param, buf + param->n, addr_as_bytes, bitmaskSeed);

    //generate n-byte mask
    set_key_or_mask(addr, 1);
    addr_to_bytes(addr_as_bytes, addr);
    PRF(param, bitmask, addr_as_bytes, bitmaskSeed);

    for (int i = 0; i < param->n; i++) {
        buf[2* param->n + i] = in[i] ^ bitmask[i];
    }
    calc_sha_256(out, buf, sizeof(buf));
}
*/
void gen_chain(struct params *param, uint8_t *out, uint8_t *in, int start, int steps)
{
    uint8_t result[param->n];
    memcpy(out, in, param->n);
    for (int i = start; i < (start+steps) && i < param->w; i++) {
        //set_hash_addr(addr, i);
        //HASH_F(param, out, out, bitmaskSeed, addr);
        calc_sha_256(out, out, param->n);
    }
}

void gen_pk(struct params *param, uint8_t *pk , uint8_t *puf) {


    expand_seed(param, puf, pk);
    for (int i = 0; i < param->len; i++ ) {
        //set_chain_addr(addr, i);
        gen_chain(param, pk + i*param->n, pk + i*param->n, 0 , param->w-1);
    }
}


void authenticate(struct params *param, uint8_t *sign, uint8_t *msg, size_t msg_len, uint8_t challenge[32]) {

    int length[param->len];
    uint8_t msg_hash[32];
    uint8_t puf_response[32];
    calc_sha_256(msg_hash, msg, msg_len);
    puf(challenge, puf_response);
    chain_lengths(param, length, msg_hash);

    expand_seed(param, puf_response, sign);

    for (int i = 0 ; i < param->len; i++ ) {

        //set_chain_addr(addr, i);
        gen_chain(param, sign + i*param->n, sign + i*param->n, 0, length[i]);

    }

}

int verify(struct params *param, uint8_t *sign, uint8_t *msg, uint8_t ID[32], char *path, size_t path_length) {

    int length[param->len];
    uint8_t out2[param->len * param->n];
    uint8_t pk_ver[32];
    chain_lengths(param, length, msg);

    for (int i = 0; i < param->len; i++) {
        //set_chain_addr(addr, i);
        gen_chain(param, out2 + i*param->n, sign + i*param->n, length[i], param->w - 1 - length[i]);
    }
    calc_sha_256(pk_ver, out2, sizeof(out2));
    //char *path_example_1 = "{\"rule\":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],\"path\":[\"0efff60d4a67e91eef1eb69b78eb1b7bcd84393a182e57b29d406d9d663a81b3\",\"2c6b306c1ab5d04aaa237316a97d0396b90ed84fe3139955aeac44fc321ff25b\",\"ba1edad7eb7e33cc3db7af14f22573feee39a7d791cf6cb4832df3829d9381d8\",\"27022442eeb198131ba9bf6a49bc079b778e1c062343014c15b5f9d947dfe29b\",\"e0f4014ac02d93cf37cdbacd203712ee18fb35d0bbc628a7a9874cef4cef4a95\",\"ec12a123256be2154303b56e9d4aee34a733b221a19309e39711a0219c41eba2\",\"c789a5d262b529460a341ce24f9de3bddca97d824f3e1e97586c6e70c892f763\",\"42e0ee68adcb844d5b3f58f26e068d5fb3e247f7cc29ad843929d88fc6b94440\",\"6e86be208ef39bec2e98e69ee5416116563d3c2af3a879402051eafcbf4e9fd6\",\"dcbc5649a3b9a6a06ef5b0561c02128f456d1ed590fd6b28a49986f66985c0b5\",\"e72678d486e0d209d104111da6eaf8e91b7f1c63e91a51bc3b0eb2424202c4a8\",\"610d8435d6a2ee76c364ce13d622df5c5629048dbd4fd265786d07c23e5c2d1b\",\"ea691d74fdf0b12b9f2f1103a1883b2811c3e2c875f14aee95fcb3180d288aec\",\"cd4d1d0ea70af4dac80011d49fcad2b428d81a353e4c1a9430fbd952e1566e0b\",\"d3900e3d5cf9547b74693eb935fef84e2c310351fb4a9b961ec53d3101706fbc\",\"893d356b159ce69e25554a17f4ee65a9a6c8ab52316908da339a49857575fed7\",\"ca9d97550fdcb4844b3cf98ad16b2f2c29c87f6e7b157b0ac8c40a4e3a46ae57\",\"a985aa1836e494b50a7687ad875cf755f5ca834457e63878f6a0469b1f948b44\",\"46db36afaf512ac0ef8d243a179b832591e3b94f5e399be6cbdd85943429b1e1\",\"f2097b5138a3adb23650e4df6b885a0d7609539da2c81f6814598c1c59954501\",\"6213d7b72200169c77fee1d4a3746a748fa6c9e3fca7ea5094f5cb1ec47b211b\",\"6e340b9cffb37a989ca544e6bb780a2c78901d3fb33738768511a30617afa01d\"]}";
    //size_t path_length = strlen(path_example_1);
    uint8_t leaf[33];
    memset(leaf, 0, 33);
    memcpy(leaf+1, pk_ver, 32);
    calc_sha_256(pk_ver, leaf, sizeof(leaf));
    int res;
    res = verify_inclusion(path, path_length, ID, pk_ver);
    return res;
}

